system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         8.0;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.9;
maxAlphaCo      0.5;
maxDeltaT       0.01;

// ************************************************************************* //

functions
{
///////////////////////////////////////////////////////////////////////////
water_in_domain
{
    type            volFieldValue;
    libs ("libfieldFunctionObjects.so");

    enabled         true;
    log             true;

    //writeControl    writeTime;
    writeControl   timeStep;
    writeInterval  1;

    writeFields     false;
    writeLocation   false;	

    regionType      all;

    operation       volIntegrate;
    fields
    (
        alpha.water
    );
}

///////////////////////////////////////////////////////////////////////////
probes1
{
    type probes;
    libs ("libsampling.so");
    //dictionary probesDict;
    probeLocations
    (
	(0.82450002 0 0.021)
	(0.82450002 0 0.061)
	(0.82450002 0 0.101)
	(0.82450002 0 0.141)
	(0.8035 0 0.161)
	(0.7635 0 0.161)
	(0.7235 0 0.161)
	(0.6835 0 0.161)
    );

    fields
    (
	p p_rgh
    );

    writeControl       timeStep;
    writeInterval      1;
}
///////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////
    yplus
    {
    	type yPlus;
    	libs ("libfieldFunctionObjects.so");
    	enabled true;
        writeControl outputTime;
    }
///////////////////////////////////////////////////////////////////////////

water_in_domain
{
    type
    volFieldValue;
    libs ("libfieldFunctionObjects.so");
    enabled
    true;
    log
    true;
    //writeControl
    writeTime;
    writeControl
    timeStep;
    writeInterval 1;
    writeFields
    false;
    writeLocation
    false;
    regionType
    all;
    //select
    all;
    //on some distributions
    operation
    volIntegrate;
    fields
    (
        alpha.water
    );
}

};

